bog_app_2/app/controllers/creatures_controller.rb

def create
  @creature = Creature.new(creature_params)
  if creature.save
---
INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Dan"], ["description", "Amazing"], ["created_at", 2016-12-19 08:46:00 UTC], ["updated_at", 2016-12-19 08:46:00 UTC]]

def show
  @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

def edit
  @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

def update
  creature = Creature.find_by_id(creature_id)
  creature.update_attributes(creature_params)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "Amazin"], ["updated_at", 2016-12-19 08:53:07 UTC], ["id", 4]]

def destroy
  creature = Creature.find_by_id(creature_id)
  creature.destroy
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 1]]