bog_app/app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["description", ""], ["created_at", 2016-12-17 00:18:01 UTC], ["updated_at", 2016-12-17 00:18:01 UTC]]
---
  def create
    creature = Creature.new(creature_params)
    if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "this worked"], ["updated_at", 2016-12-19 06:56:04 UTC], ["id", 3]]
---
  def update
    creature = Creature.find_by_id(creature_id)
    creature.update_attributes(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 3]]
---
  def destroy
    creature = Creature.find_by_id(creature_id)
    creature.destroy